Revit 2024 API
FilteredElementIdIterator.GetCurrent Method
 The current element id found by the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId GetCurrent()
Visual Basic
Public Function GetCurrent As ElementId
Visual C++
public:
ElementId^ GetCurrent()
Return Value
 The element id.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  There are no more element ids in the iterator. -or- The FilteredElementCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator. -or- The iterator cannot proceed due to changes made to the Element table in Revit's database (typically, this can be the result of an Element deletion).
See Also
FilteredElementIdIterator Class
Autodesk.Revit.DB Namespace